Reports/РеестрГазЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>РеестрГазЗаявок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ГАЗЗаявки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Comment>Дата регистрации заявки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Comment>Электронная почта контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Comment>Внешний ID из системы ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиГАЗЗаявки</Name>
			<Comment>Задачи по заявкам ГАЗ: Реестр</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресацияРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было получено обращение на автозвонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура заявки ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнение</Name>
					<Comment>Причина возврата задачи на повторое исполнение (задача не принята клиентской службой)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСтатОбщая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСтатОбщая</Name>
			<Comment>Общая статистика звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разговор</Name>
					<Comment>Общая длительность разговора (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ожидание</Name>
					<Comment>Общая длительность ожидания (сек)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦРазговор</Name>
					<Comment>Длительность разговора абонента с оператором контакт-центра (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПРазговор</Name>
					<Comment>Длительность разговора абонента с конечным оператором (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЦОжидание</Name>
					<Comment>Длительность ожидания абонентом ответа оператора контакт-центра (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПОжидание</Name>
					<Comment>Длительность ожидания абонентом ответа конечного оператора (секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КЦСсылка</Name>
					<Comment>Контакт-центр ответственный за звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОПСсылка</Name>
					<Comment>Подразделение ответственное за звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПричиныНепринят</Name>
					<Comment>Код причины несостояшегося звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторИсходящего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЦАбонент</Name>
					<Comment>Внутренний телефон оператора КЦ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание звонка: сигнатура интернет-заявки, задача лояльности и пр.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/РеестрГазЗаявок/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГАЗЗаявки.Сигнатура КАК Сигнатура,
	|	ГАЗЗаявки.Начало КАК Начало,
	|	ГАЗЗаявки.Окончание КАК Окончание,
	|	ГАЗЗаявки.АбонентВнешний КАК АбонентВнешний,
	|	ГАЗЗаявки.Почта КАК Почта,
	|	ГАЗЗаявки.Ид КАК Ид,
	|	ГАЗЗаявки.ТочкаРазмещения КАК Регион,
	|	ГАЗЗаявки.Автор КАК Автор
	|ПОМЕСТИТЬ ВТ01_Заявки
	|ИЗ
	|	РегистрСведений.ГАЗЗаявки КАК ГАЗЗаявки
	|ГДЕ
	|	ГАЗЗаявки.Начало МЕЖДУ &Начало И &Окончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадачиКЦ.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ЗадачиКЦ.ЗвонокЗакрытия КАК ЗвонокЗакрытия,
	|	ЗадачиКЦ.Сигнатура КАК Сигнатура,
	|	ЗадачиКЦ.ДатаЗакрытия КАК ДатаЗакрытия,
	|	ЗадачиКЦ.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ05_ВсеЗакрытыеКЦЗадачиПоЗакрытымЗаявкам
	|ИЗ
	|	РегистрСведений.ЗадачиГАЗЗаявки КАК ЗадачиКЦ
	|ГДЕ
	|	ЗадачиКЦ.АдресацияРоль = ЗНАЧЕНИЕ(Справочник.Роли.ОператорКонтактЦентра)
	|	И ЗадачиКЦ.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗадачиКЦ.Сигнатура В
	|			(ВЫБРАТЬ
	|				ВТ01.Сигнатура
	|			ИЗ
	|				ВТ01_Заявки КАК ВТ01
	|			ГДЕ
	|				ВТ01.Окончание <> ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВТ05.ДатаЗакрытия КАК ДатаЗакрытия,
	|	РАЗНОСТЬДАТ(ВТ05.ДатаЗакрытия, ВТ01.Окончание, СЕКУНДА) КАК РазностьДат
	|ПОМЕСТИТЬ ВТ10_ВсеЗакрытыеКЦЗадачиПоЗакрытымЗаявкам
	|ИЗ
	|	ВТ01_Заявки КАК ВТ01
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ05_ВсеЗакрытыеКЦЗадачиПоЗакрытымЗаявкам КАК ВТ05
	|		ПО ВТ01.Сигнатура = ВТ05.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ10.Сигнатура КАК Сигнатура,
	|	МИНИМУМ(ВТ10.РазностьДат) КАК РазностьДат
	|ПОМЕСТИТЬ ВТ15_НаименьшаяРазностьДатаЗакрытияЗадачиИЗаявки
	|ИЗ
	|	ВТ10_ВсеЗакрытыеКЦЗадачиПоЗакрытымЗаявкам КАК ВТ10
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ10.Сигнатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ10.Сигнатура КАК Сигнатура,
	|	ВТ10.ДатаЗакрытия КАК ДатаЗакрытия,
	|	ВЫБОР
	|		КОГДА ВТ05.ЗвонокЗакрытия <> """"
	|			ТОГДА ЕСТЬNULL(Звонки.ИнициаторИсходящего, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|		ИНАЧЕ ВТ05.Исполнитель
	|	КОНЕЦ КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА ВТ05.ЗвонокЗакрытия <> """"
	|			ТОГДА ВТ05.ЗвонокЗакрытия
	|		ИНАЧЕ ВТ05.ПричинаЗакрытия
	|	КОНЕЦ КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ВТ20_ПоследниеЗакрытыеЗадачиКЦПоЗакрытымЗаявкам
	|ИЗ
	|	ВТ10_ВсеЗакрытыеКЦЗадачиПоЗакрытымЗаявкам КАК ВТ10
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ15_НаименьшаяРазностьДатаЗакрытияЗадачиИЗаявки КАК ВТ15
	|		ПО ВТ10.РазностьДат = ВТ15.РазностьДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ05_ВсеЗакрытыеКЦЗадачиПоЗакрытымЗаявкам КАК ВТ05
	|		ПО (ВТ05.Сигнатура = ВТ10.Сигнатура)
	|			И (ВТ05.ДатаЗакрытия = ВТ10.ДатаЗакрытия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗвонкиСтатОбщая КАК Звонки
	|		ПО (ВТ05.ЗвонокЗакрытия <> """")
	|			И (ВТ05.ЗвонокЗакрытия = Звонки.Сигнатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ01.Сигнатура КАК Сигнатура,
	|	ВТ01.Ид КАК Ид,
	|	ВТ01.Регион КАК Регион,
	|	ВТ01.Начало КАК Начало,
	|	ВТ01.Окончание КАК Окончание,
	|	ВТ01.Автор КАК Постановщик,
	|	ЕСТЬNULL(ВТ20.Исполнитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Исполнитель,
	|	ЕСТЬNULL(ВТ20.ПричинаЗакрытия, """") КАК ПричинаЗакрытия,
	|	ЕСТЬNULL(ЗадачиПроверки.Исполнитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Проверяющий
	|ИЗ
	|	ВТ01_Заявки КАК ВТ01
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ20_ПоследниеЗакрытыеЗадачиКЦПоЗакрытымЗаявкам КАК ВТ20
	|		ПО ВТ01.Сигнатура = ВТ20.Сигнатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиГАЗЗаявки КАК ЗадачиПроверки
	|		ПО (ЗадачиПроверки.АдресацияРоль <> ЗНАЧЕНИЕ(Справочник.Роли.ОператорКонтактЦентра))
	|			И (ЗадачиПроверки.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (ЕСТЬNULL(ЗадачиПроверки.ДатаПостановки, ДАТАВРЕМЯ(1, 1, 1)) = ЕСТЬNULL(ВТ20.ДатаЗакрытия, ДАТАВРЕМЯ(1, 1, 1)))";
	
	Запрос.УстановитьПараметр("Начало", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание",	Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	СКД = ПолучитьМакет("ОсновнаяСКД");	
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);


КонецПроцедуры
